	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЭлектронноеПисьмоВходящее КАК Таблица
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(Таблица.ОтправительКонтакт) = ТИП(СТРОКА) И Таблица.ОтправительКонтакт <> """" ИЛИ Таблица.ОтправительКонтакт = НЕОПРЕДЕЛЕНО)
	|	
	|ОБЪЕДИНИТЬ ВСЕ	
	|	
	|ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЭлектронноеПисьмоВходящее.ПолучателиПисьма КАК Таблица
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(Таблица.Контакт) = ТИП(СТРОКА) И Таблица.Контакт <> """" ИЛИ Таблица.Контакт = НЕОПРЕДЕЛЕНО)
	|	И Таблица.Адрес <> """"
	|	И НЕ Таблица.Ссылка.ПометкаУдаления
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЭлектронноеПисьмоВходящее.ПолучателиКопий КАК Таблица
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(Таблица.Контакт) = ТИП(СТРОКА) И Таблица.Контакт <> """" ИЛИ Таблица.Контакт = НЕОПРЕДЕЛЕНО)
	|	И Таблица.Адрес <> """"
	|	И НЕ Таблица.Ссылка.ПометкаУдаления
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЭлектронноеПисьмоВходящее.ПолучателиОтвета КАК Таблица
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(Таблица.Контакт) = ТИП(СТРОКА) И Таблица.Контакт <> """" ИЛИ Таблица.Контакт = НЕОПРЕДЕЛЕНО)
	|	И Таблица.Адрес <> """"
	|	И НЕ Таблица.Ссылка.ПометкаУдаления
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЭлектронноеПисьмоИсходящее.ПолучателиПисьма КАК Таблица
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(Таблица.Контакт) = ТИП(СТРОКА) И Таблица.Контакт <> """" ИЛИ Таблица.Контакт = НЕОПРЕДЕЛЕНО)
	|	И Таблица.Адрес <> """"
	|	И НЕ Таблица.Ссылка.ПометкаУдаления
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЭлектронноеПисьмоИсходящее.ПолучателиКопий КАК Таблица
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(Таблица.Контакт) = ТИП(СТРОКА) И Таблица.Контакт <> """" ИЛИ Таблица.Контакт = НЕОПРЕДЕЛЕНО)
	|	И Таблица.Адрес <> """"
	|	И НЕ Таблица.Ссылка.ПометкаУдаления
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЭлектронноеПисьмоИсходящее.ПолучателиОтвета КАК Таблица
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(Таблица.Контакт) = ТИП(СТРОКА) И Таблица.Контакт <> """" ИЛИ Таблица.Контакт = НЕОПРЕДЕЛЕНО)
	|	И Таблица.Адрес <> """"
	|	И НЕ Таблица.Ссылка.ПометкаУдаления
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СообщениеSMS.Адресаты КАК Таблица
	|ГДЕ
	|	Таблица.Контакт = НЕОПРЕДЕЛЕНО
	|	И Таблица.КакСвязаться <> """"
	|	И НЕ Таблица.Ссылка.ПометкаУдаления
	|	
	|	СГРУППИРОВАТЬ
	|ПО
	|	Ссылка
	|";
	
