Функция Обработчик(Параметр1, Параметр2, Отказ, Параметр4)
    Отказ = Истина;
    Возврат А; Возврат А;

    Для Каждого Элемент Из Новый Массив Цикл
        Сообщить("Да")
    КонецЦикла;
КонецФункции

&ИзменениеИКонтроль("Тест1")
Процедура рар_Тест1()
    ПропущенныйТокен = а + 1;
    #Вставка
    ОставшийсяТокен = c + 1;
    #КонецВставки
КонецПроцедуры

Функция ФункцияКотораяДолжнаНеУпасть()
	Возврат "🟡";
КонецФункции

Функция ФункцияКотораяНеУпадет()
	Возврат "✅";
КонецФункции

#Область Тест

Проверка = Истина;
Число = 0.01;
// Комментарий?

#КонецОбласти